---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFieldType.Instance
enum: Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType.Instance

An instance parameter of the scheduled elements. All shared parameters
 also use this type, regardless of whether they are instance or type
 parameters.